
&НаСервере
Процедура ПересчитатьОбщуюПлощадь()
	ПРоект = РеквизитФормыВЗначение("Объект");
	Проект.ПлощадьВсего = Проект.ПлощадьВнутриТепловогоКонтура + Проект.ПлощадьТеррасИКрылец;
	ЗначениеВРеквизитФормы(Проект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПлощадьВнутриТепловогоКонтураПриИзменении(Элемент)
	ПересчитатьОбщуюПлощадь();
	ПересчитатьСтоимостьРаботЗаМетрНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПлощадьТеррасИКрылецПриИзменении(Элемент)
	ПересчитатьОбщуюПлощадь();
	ПересчитатьСтоимостьРаботЗаМетрНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РаботыПоПроектуОбъемПриИзменении(Элемент)
	ТекДанные = Элементы.РаботыПоПроекту.ТекущиеДанные;
	РаботаСДокументамиКлиент.ПересчитатьСтрокуВПроекте(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура РаботыПоПроектуРасценкаПриИзменении(Элемент)
	ТекДанные = Элементы.РаботыПоПроекту.ТекущиеДанные;
	РаботаСДокументамиКлиент.ПересчитатьСтрокуВПроекте(ТекДанные);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтоимостьРаботЗаМетрНаСервере()
	ДокПРоект = РеквизитФормыВЗначение("Объект");
	СтоимостьРабот = ДокПРоект.РаботыПоПроекту.Итог("СметнаяСтоимость");
	ДокПРоект.СтоимостьРаботЗаМетр = СтоимостьРабот/ДокПРоект.ПлощадьВсего;
	ЗначениеВРеквизитФормы(ДокПРоект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура РаботыПоПроектуПриИзменении(Элемент)
	ПересчитатьСтоимостьРаботЗаМетрНаСервере();
КонецПроцедуры

