
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтоНовый() Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если СтатусПроекта = Перечисления.СтатусыПроектов.ВРаботе Тогда
		Движения.РаботыПоПроектам.Записывать = Истина;
		Для Каждого ТекСтрокаРаботыПоПроекту Из РаботыПоПроекту Цикл
			Движение = Движения.РаботыПоПроектам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Исполнитель = ТекСтрокаРаботыПоПроекту.Исполнитель;
			Движение.Проект = Ссылка;
			Движение.НаименованиеРабот = ТекСтрокаРаботыПоПроекту.НаименованиеРабот;
			Движение.Объем = ТекСтрокаРаботыПоПроекту.Объем;
			Движение.Сумма = ТекСтрокаРаботыПоПроекту.СметнаяСтоимость;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
