
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.РаботыПоПроектам.Записать();
	Движения.Взаиморасчеты.Записать();
	Движения.РаботыПоПроектам.Записывать = Истина;
	Движения.Взаиморасчеты.Записывать = Истина;
	
	
	// регистр Взаиморасчеты Расход
	Если РаботыПоПроекту.Количество() <> 0 Тогда
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Исполнитель;
		Движение.Проект = Проект;
		Движение.Сумма = СуммаПоДокументу;
	КОнецЕсли;
	
	
	Движения.Взаиморасчеты.Записать();
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КСРаботыПоПроекту.НаименованиеРабот КАК НаименованиеРабот,
	|	КСРаботыПоПроекту.Объем КАК ОбъемДок
	|ПОМЕСТИТЬ ДанныеТЧ
	|ИЗ
	|	Документ.КС.РаботыПоПроекту КАК КСРаботыПоПроекту
	|ГДЕ
	|	КСРаботыПоПроекту.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТЧ.НаименованиеРабот КАК НаименованиеРабот,
	|	ДанныеТЧ.ОбъемДок КАК ОбъемДок,
	|	ЕСТЬNULL(РаботыПоПроектамОстатки.ОбъемОстаток, 0) КАК ОбъемОстаток,
	|	ЕСТЬNULL(РаботыПоПроектамОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ДанныеТЧ.НаименованиеРабот.Представление КАК РаботаИмя
	|ИЗ
	|	ДанныеТЧ КАК ДанныеТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РаботыПоПроектам.Остатки(
	|				&МомВремени,
	|				Исполнитель = &Исполнитель
	|					И Проект = &Проект) КАК РаботыПоПроектамОстатки
	|		ПО ДанныеТЧ.НаименованиеРабот = РаботыПоПроектамОстатки.НаименованиеРабот";
	
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Запрос.УстановитьПараметр("МомВремени", МоментВремени());
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ОбъемОстаток < ВыборкаДетальныеЗаписи.ОбъемДок Тогда
			РазмерПревышения = ВыборкаДетальныеЗаписи.ОбъемДок - ВыборкаДетальныеЗаписи.ОбъемОстаток;
			Сообщить("Зафиксировано превышение объема работ по: """ + ВыборкаДетальныеЗаписи.РаботаИмя + 
			""" на " + РазмерПревышения);
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		Если Не Отказ Тогда
			Движение = Движения.РаботыПоПроектам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Исполнитель = Исполнитель;
			Движение.Проект = Проект;
			Движение.НаименованиеРабот = ВыборкаДетальныеЗаписи.НаименованиеРабот;
			Движение.Объем = ВыборкаДетальныеЗаписи.ОбъемДок;
			СуммаСписания = ?(ВыборкаДетальныеЗаписи.ОбъемОстаток = ВыборкаДетальныеЗаписи.ОбъемДок,
			ВыборкаДетальныеЗаписи.СуммаОстаток, ВыборкаДетальныеЗаписи.СуммаОстаток/ВыборкаДетальныеЗаписи.ОбъемОстаток * 
			Движение.Объем);
			Движение.Сумма = СуммаСписания;	
		КонецЕсли;
	КонецЦикла;
		
		Движения.РаботыПоПроектам.Записать();
		
		
		
		
		
		//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!
		//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		СуммаПоДокументу = РаботыПоПроекту.Итог("СметнаяСтоимость");
	КонецПроцедуры
